C03/Nz200/Nz200_ref/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./setUp/parameters"

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       csv;

fields          (U p_rgh alpha.concrete nu1);

sets
(
    data
    {
        type    lineUniform;
        axis    z;
        start   (#calc"$Lx / 2"  0  0);
        end     (#calc"$Lx / 2"  0  #calc"$h0 * 2");
        nPoints #calc"$numOfVol_concrete * 2";
    }
);


// ************************************************************************* //
